app/controllers/pages_controller.rb

  def profile
    if(User.find_by_username(params[:id]))
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT 1  [["username", "webfactori"]]